[
  
  {
    "id": "hell-for-leather",
    "href": "project-template.html?id=hell-for-leather",
    "imgSrc": "assets/hell for leather 1.png",
    "imgAlt": "Hell For Leather",
    "title": "Hell For Leather",
    "year": "2024",
    "description": "OpenGL Racing Game with a Physically Based Rendering (PBR) pipeline, custom vehicle physics, and optimized real-time collision and suspension dynamics.",
    "longDescription": "This 3D racing simulation was a third-year OpenGL project focused on implementing advanced graphics and physics systems from the ground up. The project features a complete Physically Based Rendering (PBR) pipeline for realistic, physically-grounded materials and lighting, all set within a 3D skybox. A core technical component is the optimized collision engine, which uses a spatial grid to accelerate queries. This allows for real-time suspension physics (via ray-triangle intersection queries) and accurate track collisions (via AABB checks). The demo is complete with vehicle physics, a flexible follow-cam, 3D model loading via Assimp, and a full UI with a lap timer.",
    "tags": ["OpenGL", "C++", "PBR"],
    "dateCompleted": "2024",
    "projectType": "Pair Project",
    "githubURL": "https://github.com/aishakwatra/racingsimulation",
    "gameURL": "https://matt-pongsagon.itch.io/hell-for-leather-opengl-ddct",
    "features": [
      { "name": "Physically Based Rendering (PBR) for realistic lighting and materials on the car and track.", "isMine": true },
      { "name": "Optimized Collision Detection: Employs a spatial grid to accelerate all collision queries. This structure enables fast ray-triangle intersection queries (with all four wheels) and AABB-triangle checks (for side impacts against the track's geometry).", "isMine": true },
      { "name": "Flexible Camera Controller: Features a dynamic follow-cam that tracks the car, pulling back at high speeds and shifting during turns. The system also allows the user to take manual control and orbit the camera.", "isMine": false },
      { "name": "Sound Management: A central sound system manages all game audio, like engine sounds and effects.", "isMine": true },
      { "name": "UI & Text: Renders text on-screen for the HUD, including a lap timer, best lap display, and a car selection menu.", "isMine": true },
      { "name": "Vehicle Physics: Includes handling for acceleration, braking, steering and jumping to make the driving feel more believable.", "isMine": false },
      { "name": "Lap Timer: Uses a 3D trigger volume at the finish line to accurately track lap times and save the best-lap record.", "isMine": true },
      { "name": "3D Environment: Skybox to create the 3D sky and background.", "isMine": false }
    ],
    "myFeatures": [],
    "media": {
      "videoURL": "https://www.youtube.com/embed/QgssG5bXjFo?si=9eT8u6Q6Fw-Kn3UR",
      "images": [
        "assets/hell for leather 1.png",
        "assets/hell for leather 2.png",
        "assets/hell for leather 3.png"
      ]
    }
  },

  {
    "id": "flour-sim",
    "href": "project-template.html?id=flour-sim",
    "imgSrc": "assets/flour1.png",
    "imgAlt": "GPU Flour Sifting Animation",
    "title": "GPU Flour Sifting Animation",
    "year": "2024",
    "description": "A high-performance particle simulation modeling granular materials using OpenGL Compute Shaders with real-time accumulation and dynamic collisions.",
    "longDescription": "This project is a high-performance simulation of granular materials, specifically flour, implemented using OpenGL and C++. The core of the simulation runs on the GPU via Compute Shaders, managing the physics and collision detection for a massive number of particles without CPU bottlenecks. A key feature is the heightmap accumulation system, which uses atomic image operations to allow particles to pile up realistically on a surface, dynamically modifying the terrain. The simulation also features a procedural collision system for the sifter, approximating a wire mesh grid to filter particles based on their trajectory and the sieve's movement.",
    "tags": ["OpenGL", "C++", "Compute Shaders", "GLSL", "Simulation"],
    "dateCompleted": "2024",
    "projectType": "Individual Project",
    "githubURL": "https://github.com/aishakwatra/flour-sifting-animation",
    "gameURL": null,
    "features": [
      { "name": "Compute Shader Architecture: Offloaded physics calculations (gravity, velocity integration) to the GPU, enabling the simulation of massive particle counts at real-time framerates.", "isMine": true },
      { "name": "Heightmap Accumulation: Implemented a deposition algorithm using GLSL `imageAtomicAdd` to transfer particle mass to a 2D texture, creating accurate piles and terrain deformation.", "isMine": true },
      { "name": "Procedural Mesh Collision: Developed a shader-based collision system that analytically models the sifter's wire grid (`sifterBarAt`), allowing particles to either bounce off wires or pass through holes based on position.", "isMine": true },
      { "name": "Dynamic Sifter Animation: Integrated a sine-wave based motion controller to simulate the shaking and sifting action, which directly influences particle momentum.", "isMine": true },
      { "name": "Particle Recycling System: Implemented a boundary check system that seamlessly respawns particles falling below the kill-plane, ensuring a continuous flow of material.", "isMine": true }
    ],
    "myFeatures": [],
    "media": {
      "videoURL": "https://www.youtube.com/embed/b25BQ1ls_pw?si=3FQkQIgZIu1FAP7X",
      "images": [
        "assets/flour1.png",
        "assets/flour3.png",
        "assets/flour4.png",
        "assets/flour2.png"
      ]
    }
  },

  {
    "id": "cuda-raytrace",
    "href": "project-template.html?id=cuda-raytrace",
    "imgSrc": "assets/cuda1.png",
    "imgAlt": "Real time Ray Tracing with CUDA",
    "title": "Real time Ray Tracing with CUDA",
    "year": "2024",
    "description": "An extension of a professor-provided real-time CUDA ray tracing engine. The project implements ray tracing for triangles, procedurally generated object textures, interactive camera movements, and dynamic collision detection in real-time.",
    "longDescription": "This project is an interactive mini-game built for a low-level programming class, extending a real-time CUDA ray tracing engine provided by my professor. The experience takes the user through multiple unique rooms using WASD controls. It begins in an Infinity Mirrors room, inspired by Yayoi Kusama, which uses highly reflective surfaces to create a visually infinite space. The final room features dynamic, floating spheres that collide and bounce off the environment in real-time.",
    "tags": ["CUDA", "C++", "Parallel Programming"],
    "dateCompleted": "2024",
    "projectType": "Individual Project",
    "githubURL": "https://github.com/pongsagon/DDCT_CUDA_Raytrace",
    "gameURL": "https://matt-pongsagon.itch.io/cuda-raytrace-ddct",
    "features": [
      { "name": "Extended the ray tracer to render complex triangle meshes, not just the original spheres.", "isMine": true },
      { "name": "Implemented real-time physics for sphere-to-sphere and sphere-to-triangle-surface collisions.", "isMine": true },
      { "name": "Procedurally generated unique patterns for the surface materials.", "isMine": true },
      { "name": "Created a system for materials and colors to update dynamically based on user interaction.", "isMine": true },
      { "name": "Designed a multi-room experience with WASD navigation.", "isMine": true },
      { "name": "Built a dynamic scene where floating, refractive spheres realistically bounce off surfaces and eachother", "isMine": true }
    ],
    "myFeatures": [],
    "media": {
      "videoURL": "https://www.youtube.com/embed/6XbfCoaFQCI?si=uEWPyFNPpgSCWcGU",
      "images": [
        "assets/cuda1.png",
        "assets/cuda2.png"
      ]
    }
  },
  {
    "id": "soteria-xr",
    "href": "project-template.html?id=soteria-xr",
    "imgSrc": "assets/soteriaXR-5.png",
    "imgAlt": "SoteriaXR - Fire Escape Training",
    "title": "SoteriaXR - Fire Escape Training",
    "year": "2024",
    "description": "Customizable fire escape training tool developed for the Meta Quest 3.",
    "longDescription": "This project is a Mixed Reality (MR) training application developed for the Meta Quest 3 headset, designed to overcome the limitations of traditional and generic Virtual Reality safety programs. By blending virtual hazards and tools directly into the user's actual physical environment, Soteria XR provides highly personalized and practical fire safety drills. A central feature is the customizable scenario editor, which allows users to map fire locations and necessary equipment to their real surroundings, ensuring the training is relevant to the space they inhabit every day.",
    "tags": ["Unity", "XR", "Simulation"],
    "dateCompleted": "June 2025",
    "projectType": "Group",
    "githubURL": null,
    "gameURL": null,
    "features": [
      { "name": "Scene Manager uses the Meta Quest MR Utility Kit (MRUK) to scan and load the user's real-world room spatial data, perform checks and prompts spatial scans if unavailable. Ensuring virtual hazards and equipment are perfectly aligned with physical furniture and walls.", "isMine": true },
      { "name": "Custom Scenario Editor: A runtime editor allows the user to freely position virtual fire hazards, alarms, fire extinguishers, and exit points within their scanned environment to design unique training situations.", "isMine": false },
      { "name": "Scenario setups, including object placements and positions, are accurately saved using Spatial Anchors and a custom JSON system so that custom layouts persist and can be reloaded across sessions.", "isMine": false },
      { "name": "Fire Simulation: Fire and sprinkler behavior relies on a Voxel Grid system based on the room's spatial data; extinguishing is managed by a voxel health system that uses raycast intersection calculations (for the extinguisher and sprinklers) to reduce fire damage", "isMine": true },
      { "name": "Fire extinguishers are fully interactive, requiring the user to physically remove the safety pin and operate the nozzle by following the official P.A.S.S. method", "isMine": false },
      { "name": "The application includes two modes: a Step-by-Step Training Mode with continuous guided dialogue and an Unguided Testing Mode for autonomous performance evaluation.", "isMine": false },
      { "name": "A Score System tracks adherence to safety protocol and remaining health, providing a final score and detailed checklist feedback on all completed and missed steps.", "isMine": true }

    ],
    "myFeatures": [],
    "media": {
      "videoURL": "https://www.youtube.com/embed/g8RNuf9I1_c?si=8Bq_RNWCepFMedjN",
      "images": [
        "assets/soteriaXR-1.png",
        "assets/soteriaXR-2.png",
        "assets/soteriaXR-3.png",
        "assets/soteriaXR-4.png",
        "assets/soteriaXR-5.png"
      ]
    }
  },
  {
    "id": "area-51",
    "href": "project-template.html?id=area-51",
    "imgSrc": "assets/area51-1.png",
    "imgAlt": "Area51 - They can't stop us all",
    "title": "Area51 - They can't stop us all",
    "year": "2022",
    "description": "A 2D Platformer game developed on Unity for a term project in my first year.",
    "longDescription": "This project was a 2D Platformer game developed for a first-year term project using Unity and C#. The goal was to learn the fundamentals of the Unity engine, including physics, sprite management, and level design. We explored techniques for wave generation and basic rendering.",
    "tags": ["Unity", "C#", "2D Game Development"],
    "dateCompleted": "December 2022",
    "projectType": "Group",
    "githubURL": "https://github.com/Vibhumi-Sermsilp/DT130-SEM1-2022",
    "gameURL": null,
    "features": [
      { "name": "Real-time Fast Fourier Transform (FFT) for wave generation.", "isMine": false },
      { "name": "Screen-Space Reflections (SSR) for water surface.", "isMine": false },
      { "name": "Foam simulation based on wave curvature.", "isMine": false },
      { "name": "Physically-Based Rendering (PBR) material properties.", "isMine": false }
    ],
    "myFeatures": [],
    "media": {
      "videoURL": "https://www.youtube.com/embed/tGzSuIxrd4Y?si=NYrvnHC4g97LRgFZ",
      "images": [
        "assets/area51-1.png",
        "assets/area51-2.png"
      ]
    }
  }
]